Web/HTML_and_CSS_Design_and_Build_Websites/006.Tables/006.000.Notes.org
#+title: Chapter 6: Tables
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation                                                                                                                                                                                                          
| Nav   | Title                                  | Links                                   |
|-------+----------------------------------------+-----------------------------------------|
| Index | Notes Home                             | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | HTML & CSS - Design and Build Websites | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites][github]] \vert |
| Prev  | Chapter 5: Images                      | \vert [[file:../005.Images/005.000.Notes.html][html]] \vert [[file:../005.Images/005.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites/005.Images][github]] \vert |
| Next  | Chapter 7: Forms                       | \vert [[file:../007.Forms/007.000.Notes.html][html]] \vert [[file:../007.Forms/007.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites/007.Forms][github]] \vert |

* Notes

** Section 6.1: Introduction to Tables
   - A table represents information in a grid format (e.g. financial reports, TV schedules, and sports results)
   - Grids allow us to understand complex data by referencing information on two axes
   - Each block in the grid is referred to as a table cell
   - In HTML a table is written out row by row

** Section 6.2: Basic Table Structure
   - ~<table>~ element is used to create a table and the contents are written out row by row
   - ~<tr>~ indicate the start of each row using the opening ~<tr>~ tag (table row)
   - It is then followed by one or more ~<td>~ elements (one for each cell in that row) and at the end of the row you use a closing ~</tr>~ tag
   - Each cell of a table is represented using a ~<td>~ element (table data) and at the end of each cell you use a closing ~</td>~ tag
   - ~<th>~ element is used just like the ~<td>~ element but its purpose is to represent the heading for either a column or a row (th stands for table heading)
   - Even if a cell has no conent you should still use a ~<td>~ or ~<th>~ element to represent the presence of an empty cell otherwise the table will not render correctly (unless using colspan or rowspan)
   - The table heading is useful for search engines, screen readers, and helps you control the appearance using CSS
   - You can use the ~scope~ attribute in the ~<th>~ element to specify if the heading is for a column or row (e.g. ~<th scope="row">Row Heading</th>~

** Section 6.3: Spanning Columns & Spanning Rows
   - The ~colspan~ attribute can be used on a ~<th>~ or ~<td>~ element and indicates how many columns that cell should run across
   - When a cell extends across more than one column, the ~<th>~ or ~<th>~ cells that would have been in the place of the wider cells are not included in the code
   - The ~rowspan~ attribute can be used on a ~<th>~ or ~<td>~ element to indicate how many rows a cell should span down the table
   - Just like ~colspan~, with ~rowspan~ you do not need to specify the ~<td>~ elements

** Section 6.4: Long Tables
   - There are three semantic elements that help distinguish between the main content, the first few rows (e.g. headers) and the last few rows (e.g. summary, accumulation, etc.)
   - These elements help people who use screen readers and also allow you to style these sections in a different manner than the rest of the table
   - ~<thead>~ element is used to encapsulate a set of table rows indicating that they comprise the head of a table with information about the table's columns
   - ~<tbody>~ element encapsulates a set of table rows indicating that they comprise the body of a table's (main) data
   - ~<tfoot>~ element encapsulates a set of table rows indicating that they comprise the foot of a table with information about the table's columns (this is usually a summary of the columns like a sum of the given numbers in a column)
   - Another feature that can be implemented because of these elements that separate the table is that when you have a long table you can keep visible the table header and the table footer and make the table body scrollable

** Section 6.5: Old Outdate Code in Tables
   - Some of the following attributes can still be found in old websites but are no longer used and is substituted by CSS
   - ~width~ attribute indicate how wide that table should be (if added to the table element) and how wide the cells should be (if added to the ~<th>~ or ~<td>~ element)
   - ~width~ attribute is specified in pixels
   - The columns in a table need to form a straight line so you often only see the ~width~ attribute on the first row and all subsequent rows follow / use that setting
   - ~cellpading~ attribute can be used in the ~<table>~ element to add space inside each cell of the table and ~cellspacing~ attribute can be used to create space between each cell of the table; again the values are specified in pixels
   - Other attributes include ~border~ and ~bgcolor~ (background color)
   - The ~border~ attribute adds a border to the element and it is specified in pixels
   - The ~bgcolor~ attribute adds a background color of the element and usually is specified as a hex code
   - Nowadays these are not used; instead you should use CSS

** Section 6.6: Creating a Simple Table
   - [[file:./006.006.Creating_A_Simple_Table/index.html][Creating a Simple Table]]
     
* Keywords
| Term                                      | Definition                                                                                                                                                                                                                                                                                        |
|-------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Table                                     | Represents a information in a grid format                                                                                                                                                                                                                                                         |
| ~<table>~ Element                         | HTML element used to create a atable and the contents are written out row by row                                                                                                                                                                                                                  |
| ~<tr>~ Element                            | Table row element is used to indicate the start of each row using the opening tag and the ending of the row using the closing tag                                                                                                                                                                 |
| ~<td>~ Element                            | Table data element is used to encapsulate a single cell inside the table row element                                                                                                                                                                                                              |
| ~<th>~ Element                            | Table heading is used similar to table data it is used to encapsulate a single cell that is used a heading for a specific row or column                                                                                                                                                           |
| ~scope~ Attribute                         | The scope attribute is used in ~<th>~ element to specify if the heading belongs to a column or a row                                                                                                                                                                                              |
| ~colspan~ and ~rowspan~ Attribute         | Both attributes are used for either ~<th>~ or ~<td>~ and extend the table cell across either multiple columns or multiple rows                                                                                                                                                                    |
| ~<thead>~ Element                         | An element used inside the ~<table>~ element and it encapsulates a set of table rows indicating that they comprise the head of a table with information about the table's columns                                                                                                                 |
| ~<tbody>~ Element                         | An element used inside the ~<table>~ (typically after the table head) and it encapsulates a set of table rows indicating that they comprise the body of a table's main data                                                                                                                       |
| ~<tfoot>~ Element                         | An element used inside the ~<table>~ (typically after the table body) and it encapsulates a set of table rows indicating that they comprise the foot of a table with information about the table's columns (this is usually a summary of the columns like a sum of the given numbers in a column) |
| ~width~ Attribute                         | The width attribute is an old attribute that is no longer used because CSS is used instead but this attribute indicate how wide the table should be or how wide the cells should be                                                                                                               |
| ~cellpadding~ and ~cellspacing~ Attribute | Both attributes are older attributes that are no longer used because of CSS but cellpadding controls the space inside each cell while cellspacing controls the space between each cell of the table                                                                                               |
| ~border~ and ~bgcolor~ Attribute          | Both attributes are older attributes that are no longer used because of CSS but border allows you to specify a border to the table or cell and background color allows you to specify a background color to the table or cell                                                                     |

* Questions
  - *Q*: Can you have different borders for table and cells?
         - No you cannot
	 - The border attribute seems like it would only work in the table element and not in any of the children element such as ~thead~, ~tr~ or ~td~
	 - Here is an example: [[file:./006.007.Questions/q1.html][HTML Example]]
	 - Why is that the case? This is because once you specify the ~border~ attribute will have borders in all cells and rows
	 - The border attribute doesn't work in cells or rows because this will simply be overwritten by the table border since it does rows and cells
	   
  - *Q*: Can you have different background colors for different cells?
         - Yes you can
	 - The ~bgcolor~ attribute can be used on the table, table head, table body, table foot, table row, table data (cell), table header (~<th>~), and many more elements
	 - Here is an example: [[file:./006.007.Questions/q2.html][HTML Example]]
	   
* Summary
  - A table represents information in a grid format
  - In HTML a table is written out row by row
  - ~<table>~ element is used to create a table and the contents are written out row by row
  - ~<tr>~ element is used to create a table row
  - ~<td>~ element is used to create a table cell and using that element you specify the contents of the cell
  - ~<th>~ element is used to create a table heading cell to indicate the heading for a row or a column
  - You can use the attribute ~scope~ inside ~<th>~ to specify if the heading cell is for a row or a column
  - A single cell can span multiple columns or multiple rows using the attribute ~colspan~ or ~rowspan~ and specify the amount of rows / columns you want it to span
  - The attribute ~colspan~ and ~rowspan~ can only be specified in table cell elements such as ~<th>~ or ~<td>~
  - You can separate the table into three parts: ~<thead>~, ~<tbody>~, and ~<tfoot>~
  - The table head encapsulates the rows at the beginning of the table that often describe information about the table's columns
  - The table body encapsulates the rows in the middle of the table that often hold the main data information of the table
  - The table foot encapsulates the last rows of the table that often hold summary information of the columns or rows such as sum of a column
  - There are some outdated attributes that are no longer used because CSS is used instead but these include: ~width~, ~cellpadding~, ~cellspacing~, ~border~, and ~bgcolor~
  - The width can specify the width of the table or cell, the cell padding specifies how much space to add inside a cell of the table, the cell spacing specifies how much space to add between cells, border specifies how thick (or no border) you want the border of the table, and the background color specifies what color you want the background to be of the table or table cell
