Web/HTML_and_CSS_Design_and_Build_Websites/006.Tables/006.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 12:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 6: Tables</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 6: Tables</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb5ab57a">Navigation</a></li>
<li><a href="#orgd3948d3">Notes</a>
<ul>
<li><a href="#orgcb52d87">Section 6.1: Introduction to Tables</a></li>
<li><a href="#orga9ca780">Section 6.2: Basic Table Structure</a></li>
<li><a href="#org48a8e93">Section 6.3: Spanning Columns &amp; Spanning Rows</a></li>
<li><a href="#orgd0443d9">Section 6.4: Long Tables</a></li>
<li><a href="#org0b42e7e">Section 6.5: Old Outdate Code in Tables</a></li>
<li><a href="#org4e0b5a9">Section 6.6: Creating a Simple Table</a></li>
</ul>
</li>
<li><a href="#org97619f8">Keywords</a></li>
<li><a href="#org2a41bbf">Questions</a></li>
<li><a href="#org93b7d02">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5ab57a" class="outline-2">
<h2 id="orgb5ab57a">Navigation</h2>
<div class="outline-text-2" id="text-orgb5ab57a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 5: Images</td>
<td class="org-left">&vert; <a href="../005.Images/005.000.Notes.html">html</a> &vert; <a href="../005.Images/005.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites/005.Images">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 7: Forms</td>
<td class="org-left">&vert; <a href="../007.Forms/007.000.Notes.html">html</a> &vert; <a href="../007.Forms/007.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites/007.Forms">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd3948d3" class="outline-2">
<h2 id="orgd3948d3">Notes</h2>
<div class="outline-text-2" id="text-orgd3948d3">
</div>
<div id="outline-container-orgcb52d87" class="outline-3">
<h3 id="orgcb52d87">Section 6.1: Introduction to Tables</h3>
<div class="outline-text-3" id="text-orgcb52d87">
<ul class="org-ul">
<li>A table represents information in a grid format (e.g. financial reports, TV schedules, and sports results)</li>
<li>Grids allow us to understand complex data by referencing information on two axes</li>
<li>Each block in the grid is referred to as a table cell</li>
<li>In HTML a table is written out row by row</li>
</ul>
</div>
</div>

<div id="outline-container-orga9ca780" class="outline-3">
<h3 id="orga9ca780">Section 6.2: Basic Table Structure</h3>
<div class="outline-text-3" id="text-orga9ca780">
<ul class="org-ul">
<li><code>&lt;table&gt;</code> element is used to create a table and the contents are written out row by row</li>
<li><code>&lt;tr&gt;</code> indicate the start of each row using the opening <code>&lt;tr&gt;</code> tag (table row)</li>
<li>It is then followed by one or more <code>&lt;td&gt;</code> elements (one for each cell in that row) and at the end of the row you use a closing <code>&lt;/tr&gt;</code> tag</li>
<li>Each cell of a table is represented using a <code>&lt;td&gt;</code> element (table data) and at the end of each cell you use a closing <code>&lt;/td&gt;</code> tag</li>
<li><code>&lt;th&gt;</code> element is used just like the <code>&lt;td&gt;</code> element but its purpose is to represent the heading for either a column or a row (th stands for table heading)</li>
<li>Even if a cell has no conent you should still use a <code>&lt;td&gt;</code> or <code>&lt;th&gt;</code> element to represent the presence of an empty cell otherwise the table will not render correctly (unless using colspan or rowspan)</li>
<li>The table heading is useful for search engines, screen readers, and helps you control the appearance using CSS</li>
<li>You can use the <code>scope</code> attribute in the <code>&lt;th&gt;</code> element to specify if the heading is for a column or row (e.g. <code>&lt;th scope="row"&gt;Row Heading&lt;/th&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-org48a8e93" class="outline-3">
<h3 id="org48a8e93">Section 6.3: Spanning Columns &amp; Spanning Rows</h3>
<div class="outline-text-3" id="text-org48a8e93">
<ul class="org-ul">
<li>The <code>colspan</code> attribute can be used on a <code>&lt;th&gt;</code> or <code>&lt;td&gt;</code> element and indicates how many columns that cell should run across</li>
<li>When a cell extends across more than one column, the <code>&lt;th&gt;</code> or <code>&lt;th&gt;</code> cells that would have been in the place of the wider cells are not included in the code</li>
<li>The <code>rowspan</code> attribute can be used on a <code>&lt;th&gt;</code> or <code>&lt;td&gt;</code> element to indicate how many rows a cell should span down the table</li>
<li>Just like <code>colspan</code>, with <code>rowspan</code> you do not need to specify the <code>&lt;td&gt;</code> elements</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0443d9" class="outline-3">
<h3 id="orgd0443d9">Section 6.4: Long Tables</h3>
<div class="outline-text-3" id="text-orgd0443d9">
<ul class="org-ul">
<li>There are three semantic elements that help distinguish between the main content, the first few rows (e.g. headers) and the last few rows (e.g. summary, accumulation, etc.)</li>
<li>These elements help people who use screen readers and also allow you to style these sections in a different manner than the rest of the table</li>
<li><code>&lt;thead&gt;</code> element is used to encapsulate a set of table rows indicating that they comprise the head of a table with information about the table's columns</li>
<li><code>&lt;tbody&gt;</code> element encapsulates a set of table rows indicating that they comprise the body of a table's (main) data</li>
<li><code>&lt;tfoot&gt;</code> element encapsulates a set of table rows indicating that they comprise the foot of a table with information about the table's columns (this is usually a summary of the columns like a sum of the given numbers in a column)</li>
<li>Another feature that can be implemented because of these elements that separate the table is that when you have a long table you can keep visible the table header and the table footer and make the table body scrollable</li>
</ul>
</div>
</div>

<div id="outline-container-org0b42e7e" class="outline-3">
<h3 id="org0b42e7e">Section 6.5: Old Outdate Code in Tables</h3>
<div class="outline-text-3" id="text-org0b42e7e">
<ul class="org-ul">
<li>Some of the following attributes can still be found in old websites but are no longer used and is substituted by CSS</li>
<li><code>width</code> attribute indicate how wide that table should be (if added to the table element) and how wide the cells should be (if added to the <code>&lt;th&gt;</code> or <code>&lt;td&gt;</code> element)</li>
<li><code>width</code> attribute is specified in pixels</li>
<li>The columns in a table need to form a straight line so you often only see the <code>width</code> attribute on the first row and all subsequent rows follow / use that setting</li>
<li><code>cellpading</code> attribute can be used in the <code>&lt;table&gt;</code> element to add space inside each cell of the table and <code>cellspacing</code> attribute can be used to create space between each cell of the table; again the values are specified in pixels</li>
<li>Other attributes include <code>border</code> and <code>bgcolor</code> (background color)</li>
<li>The <code>border</code> attribute adds a border to the element and it is specified in pixels</li>
<li>The <code>bgcolor</code> attribute adds a background color of the element and usually is specified as a hex code</li>
<li>Nowadays these are not used; instead you should use CSS</li>
</ul>
</div>
</div>

<div id="outline-container-org4e0b5a9" class="outline-3">
<h3 id="org4e0b5a9">Section 6.6: Creating a Simple Table</h3>
<div class="outline-text-3" id="text-org4e0b5a9">
<ul class="org-ul">
<li><a href="./006.006.Creating_A_Simple_Table/index.html">Creating a Simple Table</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org97619f8" class="outline-2">
<h2 id="org97619f8">Keywords</h2>
<div class="outline-text-2" id="text-org97619f8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Table</td>
<td class="org-left">Represents a information in a grid format</td>
</tr>

<tr>
<td class="org-left"><code>&lt;table&gt;</code> Element</td>
<td class="org-left">HTML element used to create a atable and the contents are written out row by row</td>
</tr>

<tr>
<td class="org-left"><code>&lt;tr&gt;</code> Element</td>
<td class="org-left">Table row element is used to indicate the start of each row using the opening tag and the ending of the row using the closing tag</td>
</tr>

<tr>
<td class="org-left"><code>&lt;td&gt;</code> Element</td>
<td class="org-left">Table data element is used to encapsulate a single cell inside the table row element</td>
</tr>

<tr>
<td class="org-left"><code>&lt;th&gt;</code> Element</td>
<td class="org-left">Table heading is used similar to table data it is used to encapsulate a single cell that is used a heading for a specific row or column</td>
</tr>

<tr>
<td class="org-left"><code>scope</code> Attribute</td>
<td class="org-left">The scope attribute is used in <code>&lt;th&gt;</code> element to specify if the heading belongs to a column or a row</td>
</tr>

<tr>
<td class="org-left"><code>colspan</code> and <code>rowspan</code> Attribute</td>
<td class="org-left">Both attributes are used for either <code>&lt;th&gt;</code> or <code>&lt;td&gt;</code> and extend the table cell across either multiple columns or multiple rows</td>
</tr>

<tr>
<td class="org-left"><code>&lt;thead&gt;</code> Element</td>
<td class="org-left">An element used inside the <code>&lt;table&gt;</code> element and it encapsulates a set of table rows indicating that they comprise the head of a table with information about the table's columns</td>
</tr>

<tr>
<td class="org-left"><code>&lt;tbody&gt;</code> Element</td>
<td class="org-left">An element used inside the <code>&lt;table&gt;</code> (typically after the table head) and it encapsulates a set of table rows indicating that they comprise the body of a table's main data</td>
</tr>

<tr>
<td class="org-left"><code>&lt;tfoot&gt;</code> Element</td>
<td class="org-left">An element used inside the <code>&lt;table&gt;</code> (typically after the table body) and it encapsulates a set of table rows indicating that they comprise the foot of a table with information about the table's columns (this is usually a summary of the columns like a sum of the given numbers in a column)</td>
</tr>

<tr>
<td class="org-left"><code>width</code> Attribute</td>
<td class="org-left">The width attribute is an old attribute that is no longer used because CSS is used instead but this attribute indicate how wide the table should be or how wide the cells should be</td>
</tr>

<tr>
<td class="org-left"><code>cellpadding</code> and <code>cellspacing</code> Attribute</td>
<td class="org-left">Both attributes are older attributes that are no longer used because of CSS but cellpadding controls the space inside each cell while cellspacing controls the space between each cell of the table</td>
</tr>

<tr>
<td class="org-left"><code>border</code> and <code>bgcolor</code> Attribute</td>
<td class="org-left">Both attributes are older attributes that are no longer used because of CSS but border allows you to specify a border to the table or cell and background color allows you to specify a background color to the table or cell</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2a41bbf" class="outline-2">
<h2 id="org2a41bbf">Questions</h2>
<div class="outline-text-2" id="text-org2a41bbf">
<ul class="org-ul">
<li><b>Q</b>: Can you have different borders for table and cells?
<ul class="org-ul">
<li>No you cannot</li>
<li>The border attribute seems like it would only work in the table element and not in any of the children element such as <code>thead</code>, <code>tr</code> or <code>td</code></li>
<li>Here is an example: <a href="./006.007.Questions/q1.html">HTML Example</a></li>
<li>Why is that the case? This is because once you specify the <code>border</code> attribute will have borders in all cells and rows</li>
<li>The border attribute doesn't work in cells or rows because this will simply be overwritten by the table border since it does rows and cells</li>
</ul></li>

<li><b>Q</b>: Can you have different background colors for different cells?
<ul class="org-ul">
<li>Yes you can</li>
<li>The <code>bgcolor</code> attribute can be used on the table, table head, table body, table foot, table row, table data (cell), table header (<code>&lt;th&gt;</code>), and many more elements</li>
<li>Here is an example: <a href="./006.007.Questions/q2.html">HTML Example</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org93b7d02" class="outline-2">
<h2 id="org93b7d02">Summary</h2>
<div class="outline-text-2" id="text-org93b7d02">
<ul class="org-ul">
<li>A table represents information in a grid format</li>
<li>In HTML a table is written out row by row</li>
<li><code>&lt;table&gt;</code> element is used to create a table and the contents are written out row by row</li>
<li><code>&lt;tr&gt;</code> element is used to create a table row</li>
<li><code>&lt;td&gt;</code> element is used to create a table cell and using that element you specify the contents of the cell</li>
<li><code>&lt;th&gt;</code> element is used to create a table heading cell to indicate the heading for a row or a column</li>
<li>You can use the attribute <code>scope</code> inside <code>&lt;th&gt;</code> to specify if the heading cell is for a row or a column</li>
<li>A single cell can span multiple columns or multiple rows using the attribute <code>colspan</code> or <code>rowspan</code> and specify the amount of rows / columns you want it to span</li>
<li>The attribute <code>colspan</code> and <code>rowspan</code> can only be specified in table cell elements such as <code>&lt;th&gt;</code> or <code>&lt;td&gt;</code></li>
<li>You can separate the table into three parts: <code>&lt;thead&gt;</code>, <code>&lt;tbody&gt;</code>, and <code>&lt;tfoot&gt;</code></li>
<li>The table head encapsulates the rows at the beginning of the table that often describe information about the table's columns</li>
<li>The table body encapsulates the rows in the middle of the table that often hold the main data information of the table</li>
<li>The table foot encapsulates the last rows of the table that often hold summary information of the columns or rows such as sum of a column</li>
<li>There are some outdated attributes that are no longer used because CSS is used instead but these include: <code>width</code>, <code>cellpadding</code>, <code>cellspacing</code>, <code>border</code>, and <code>bgcolor</code></li>
<li>The width can specify the width of the table or cell, the cell padding specifies how much space to add inside a cell of the table, the cell spacing specifies how much space to add between cells, border specifies how thick (or no border) you want the border of the table, and the background color specifies what color you want the background to be of the table or table cell</li>
</ul>
</div>
</div>
</div>
</body>
</html>
